import React from 'react';
import './Blogs.css';

const Blogs = () => {
    return (
        <div>
            <div className='question'>
                <div>
                    <h2>Differences between sql and nosql databases. ?</h2>
                    <p>SQL হলো structured query language ,,আর  NoSQL হলো not only SQL| এদের মধ্যে পার্থক্য হলো,,
                        SQL হল রিলেশনাল ডাটাবেজ ম্যানেজমেন্ট সিস্টেম আর NoSQL  হল নন রিলেশনাল ডাটাবেজ ম্যানেজমেন্ট সিস্টেম|
                        SQL Database হল  table based ডাটাবেস সিস্টেম | এবং এখানে আমাদের টেবিল defend করে দিতে হয় সেখানে কয়টি row থাকবে কয়টি columns থাকবে| অন্যদিকে noSQL হল  Document based ডাটাবেস সিস্টেম এবং  কাজ করে key এবং value নিয়ে| এখানে টেবিল ক্রিয়েট হয়না এখানে কালেকশন ক্রিয়েট হয়|</p>
                </div>
                <div>
                    <h2> When should you use nodejs and when should you use mongodb ?</h2>
                    <p> NodeJS হল একটি JavaScript  runtime environment.। এটি আসলে জাভাস্ক্রিপ্টকে সার্ভারের বাইরে চলতে সাহায্য করে। এটি সার্ভার সাইড ডেভেলপমেন্টে ব্যবহৃত হয়। কিন্তু, MongoDB হল NoSQL ডাটাবেস। এটি JSON  হিসাবে ডেটা সঞ্চয় করে। এটি স্টোর ডেটার জন্য ব্যবহৃত হয়।

                        সর্বশেষে বলা যায় যে,,,MongoDB হল একটি ডাটাবেস| যেটা আমরা ডাটা সঞ্চয় করার সময় ব্যবহার করি| এবং NodeJS আমাদের ক্লায়েন্ট সাইটটিকে এর সার্ভার সাইটের মাধ্যমে ডাটাবেসের সাথে সংযোগ করার সময় ব্যবহার করি। |
                    </p>
                </div>
                <div>
                    <h2>Difference between javascript and nodejs ?</h2>
                    <p>জাভাস্ক্রিপ্ট আর node.js এর পার্থক্য কিছু নিচে দেওয়া হল,,,
                        জাভাস্ক্রিপ্ট একটি প্রোগ্রামিং ভাষা যা ওয়েবসাইটে স্ক্রিপ্ট লেখার জন্য ব্যবহৃত হয়। নোডজেএস একটি জাভাস্ক্রিপ্ট runtime environment। জাভাস্ক্রিপ্ট শুধুমাত্র ব্রাউজারে চলে। আর NodeJS এর সাহায্যে ব্রাউজারের বাইরে Javascript চালাতে পারি। Javascript মূলত ক্লায়েন্ট-সাইডে ব্যবহৃত হয়। আর NodeJS সার্ভার-সাইডে ব্যবহৃত হয়। জাভাস্ক্রিপ্ট HTML  ট্যাগ যোগ করা যায়। Nodejs এর HTML ট্যাগ যোগ করা যায় না। জাভাস্ক্রিপ্ট ফ্রন্টএন্ড ডেভেলপমেন্টে ব্যবহার করা হয়। Nodejs সার্ভার-সাইড ডেভেলপমেন্টে ব্যবহার করা হয়|</p>
                </div>
                <div>
                    <h2> What is the purpose of jwt and how does it work ?</h2>
                    <p>jwt হল Jason Web Token| আমরা jwt টোকেন ইউজ করি user বা ডাটা  identify এবং ওয়েব অ্যাপ্লিকেশন সিকিউর করার জন্য| jwt এ শুধুমাত্র ইউজার আইডেন্টিফাই হয়না, এখানে আমাদের ওয়েবসাইটে যেকোনো ডাটা সিকিউর করে রাখা যায়| jwt প্রত্যেকটা ইউজারের বা ডাটার জন্য এক একটি টোকেন তৈরি করে| সেখানে তিনটি অংশ থাকে যা ডট দিয়ে ভাগ করা থাকে, প্রথম অংশটি হেডার এবং দ্বিতীয় টি অবজেক্ট বা ইউজার ইনফর্মেশন এবং তৃতীয় অংশটি সিগনেচার যা  কাজ করে ভ্যালিড ইউজার বা ডাটা চেক করার জন্য|</p>
                </div>
            </div>
        </div>
    );
};

export default Blogs;